InformationRegisters/ххх_СообщенияПользователюРегламентныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_СообщенияПользователюРегламентныеЗадания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючФоновогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измерение3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ххх_ФормаСообщенияПользователюОбОшибках/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СообщениеОбОшибке=Параметры.ошибка;
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОшибки(Команда)
	ОчиститьОшибкиНАСервере()
КонецПроцедуры

Процедура ОчиститьОшибкиНАСервере()
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("КлючФоновогоЗадания","ОшибкиПрогрузкиВесов");
	Запрос.Текст="ВЫБРАТЬ
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Период КАК Период,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.КлючФоновогоЗадания КАК КлючФоновогоЗадания,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Измерение1 КАК Измерение1,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Измерение2 КАК Измерение2,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Измерение3 КАК Измерение3,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Сообщение КАК Сообщение,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Обработан КАК Обработан
	             |ИЗ
	             |	РегистрСведений.ххх_СообщенияПользователюРегламентныеЗадания.СрезПоследних(, КлючФоновогоЗадания = &КлючФоновогоЗадания) КАК ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних
	             |ГДЕ
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Обработан = ЛОЖЬ
	             |	И ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.КлючФоновогоЗадания = &КлючФоновогоЗадания";
	выборка=Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл		
		стр=РегистрыСведений.ххх_СообщенияПользователюРегламентныеЗадания.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(стр,выборка);
		стр.Обработан=Истина;
		стр.Записать();		
	КонецЦикла;
КонецПроцедуры
